Catalogs/ГрафикиРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ГрафикиРаботы</Name>
			<Comment>Графики работы объектов предприятия</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БудНач</Name>
					<Comment>Будние дни: начало работы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БудКон</Name>
					<Comment>Будние дни: окончание работы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БудРежим</Name>
					<Comment>Будние дни: режим работы</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимРаботыОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БудЛокально</Name>
					<Comment>Локальные вызовы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубНач</Name>
					<Comment>Суббота: начало работы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубКон</Name>
					<Comment>Суббота: окончание работы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубРежим</Name>
					<Comment>Суббота: режим работы</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимРаботыОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубЛокально</Name>
					<Comment>Локальные вызовы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВскНач</Name>
					<Comment>Воскресенье: начало работы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВскКон</Name>
					<Comment>Воскресенье: окончание работы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВскРежим</Name>
					<Comment>Воскресенье: режим работы</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимРаботыОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВскЛокально</Name>
					<Comment>Локальные вызовы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/РежимРаботыОбъекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>РежимРаботыОбъекта</Name>
			<Comment>Режим работы объекта предприятия</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выходной</Name>
					<Comment>Не работает</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дежурный</Name>
					<Comment>Дежурный режим</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
					<Comment>Рабочий режим</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ГрафикиРаботы/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ,ПроверяемыеРеквизиты)

// Будние дни: проверим правильность заполнения реквизитов
//-------------------------------------------------------------------------------------------------
	Если (ЭтотОбъект.БудРежим = Перечисления.РежимРаботыОбъекта.Выходной) Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("БудНач"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("БудКон"));
	ИначеЕсли (ЭтотОбъект.БудКон <= ЭтотОбъект.БудНач) Тогда
		Сообщить("Ошибка при указании времени начала и окончания работы для графика будних дней");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

// Суббота: проверим правильность заполнения реквизитов
//-------------------------------------------------------------------------------------------------
	Если (ЭтотОбъект.СубРежим = Перечисления.РежимРаботыОбъекта.Выходной) Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СубНач"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СубКон"));
	ИначеЕсли (ЭтотОбъект.СубКон <= ЭтотОбъект.СубНач) Тогда
		Сообщить("Ошибка при указании времени начала и окончания работы для графика субботы");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

// Воскресенье: проверим правильность заполнения реквизитов
//-------------------------------------------------------------------------------------------------
	Если (ЭтотОбъект.ВскРежим = Перечисления.РежимРаботыОбъекта.Выходной) Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВскНач"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВскКон"));
	ИначеЕсли (ЭтотОбъект.ВскКон <= ЭтотОбъект.ВскНач) Тогда
		Сообщить("Ошибка при указании времени начала и окончания работы для графика воскресенья");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

// Нормализуем некоторые реквизиты
//-------------------------------------------------------------------------------------------------
	ЭтотОбъект.Наименование = СокрЛП(ЭтотОбъект.Наименование);

// Проверим на дублирование по наименованию (сквозная проверка)
//-------------------------------------------------------------------------------------------------
	ТекстЗапроса = "
	|SELECT	COUNT(*) AS Всего
	|FROM	Справочник.ГрафикиРаботы
	|WHERE	(Ссылка <> &ЭтотОбъект) И (Наименование = &Наименование)";

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ЭтотОбъект",ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Наименование",ЭтотОбъект.Наименование);
	Результат = Запрос.Выполнить().Выбрать();

	Если (Результат.Следующий()) И (Результат.Всего > 0) Тогда
		ТекстСообщения = "Элемент с наименованием """ + СокрЛП(ЭтотОбъект.Наименование) + """ уже присутствует в справочнике";
		Сообщить(ТекстСообщения);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если (НЕ ЭтотОбъект.ПроверитьЗаполнение()) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры
